[" Why is the economy so bad has anyone told these guys there's always money in the banana stand"," face down ass up that's the way I like to contemplate the fragility of my existence"," Pretty sure you can see me practicing my \"not all Muslims are bad\" Thanksgiving talking points in the bg of a student film in Wash Sq Park."," Latest economic indicators show an uptick of growth in the manufacturing outrage sector."," red (political majority) white (racial majority) and blue (militant majority)"," My kid just asked me where Washington 3-D is, because she wants to see the presidents house...Now I can't decide if she's cute, or retarded."," Jack & Jill went up the hill, for a bit of privacy. Jill lifted her dress, to Jack's distress there was something there she hadn't confessed"," I met this amazing girl last night but got off on the wrong foot. She wanted it on her left foot. I can't help that I have horrible aim."," If this guy calls me \"sweetie\" one more time I SWEAR I'll continue to pleasantly smile and nod. "," Racism is for lazy people who don’t take the time to learn enough about someone to dislike them for a much better reason."," On a scale of 1 to 10 on the hungover scale I'm at \"can't handle this conversation with my mom about a hickey.\""," I never feel more American than when Hulu makes me pick my \"advertising experience.\""," I don't know why we need a special day for it, I vote for boobs every day."," If you told me in 1995 that you had to use an mp3 player to copy programs to a telephone in the future, I'd assume you had brain damage"," Unlike Rick Astley, this tweet is likely to let you down."," I heard a woman remarking that she had worn \"the wrong bra today\". Ladies, as long as there are boobs in it, the bra is always right."," Where do I see myself in ten years? I don't know. Let me think. *pictures self riding jet ski made of bones through space*"," I once solved a Rubik's Cube by not buying it."," Kids born after 2012 will have a hard time believing there were actually movies without Kevin Hart in them."," I need an ex-boyfriend so I have something to do on Facebook at 3 in the morning."," My food pyramid is a cup of coffee sitting on a pack of cigarettes."," Sadly learned my family is racist. I started dating a black girl. Brought her home to meet the family. Wife and kids wouldn't talk to her."," Well, it's Feb 6th 2012 and there's no meat flavored cigarettes. I guess that book of predictions I made in 5th grade was bullshit."," Medical problems are the #1 cause of death."," They say video games teach kids bad habits, but I've gotten out of at least 17 DUI's by flinging a banana peel at the cop car behind me."," If you're ever wondering what I'm thinking, there's about a 96% chance I'm thinking about what & when I'm going to eat next."," .@tonyhawk Will you kick flip over my coffin at my funeral? Need to know by Friday."," No, really, you should definitely reblog fifty more versions of that \"Keep Calm and Carry On\" poster."," WALGREENS PARADOX: No matter which Walgreens you go to, they will have built one closer to you before you can get there."," I don't care what they say, the first guy who milked a cow and drank it was a massive pervert."," What's the handicapped parking situation at the special Olympics?"," We should give the Nobel Peace Prize to the person who figures out how to clap while holding a drink at a concert."," Took and Ambien and a Viagra at the same time again. Im finding it hard to sleep."," going to park my car in the middle of this intersection until someone tells me I'm pretty"," Walked up to 2 guys talking business and told them \"get a conference room!\""," If you're happy and you know it please don't burden me with your fucking joy."," I tripped over some stupid plant so I gave it the finger and walked in a circle around it because I wasn't sure where its stupid eyes were."," I hate how my job always expects me to show up."," Movie Idea: Michael Cera falls down a spiral staircase then pets a cat."," I believe that there are two things that we can all agree on: Boobs."," My misery likes tequila, not company."," The Mancave is where I change into my Manman costume."," Negative Million Dollar Idea: devote a large portion of your 20s and 30s in pursuit of vague creative oriented career ambitions."," I spend more time pretend talking into bananas than I do real talking into my cellphone."," Plane turbulence is caused by flying over hot areas, flying over mountains, and you getting up to use the airplane bathroom"," By all sensible rules of anatomy, if you have shit for brains, you shouldn't be alive. Science, people."," When my doctor gives me a prostate exam I like to moan \"Mmmm, deeper.\" Freaks him out, but not as much as when I try to cuddle afterward."," Did u guys know u can smoke Newports on Delta flights"," I actually loved the Twilight: Eclipse movie until I realized I was actually in an alley drunk watching two cats fight over a dead mouse."," Daddy long legs are the NBA players of spiders."," I put on my pants just like you, reluctantly, when the doorbell rings."," If you want me to care about something, put a perfectly poached egg on top of it"," My penis isn't small. It's \"artisanal.\""," What's the recommended age to teach your child that Google has every answer to their homework?"," Remember when the scariest thing we had to deal with was computers forgetting what year it was"," RT if u ever stare at a computer screen for so many hours that ur body ceases to exist and u live entirely within a virtual reality"," That awkward moment when you're digging a hole to hide a body, and you find another body #truestory"," lol i'm kind of a total geek weirdo, im really into starwars, the most successful international action film franchise of all time"," \"Stop peopling around\" - horses?"," It would be a fun surprise if Jay-Z said he finished laying down some tracks and when you went outside there was a railroad."," Dear keyboard, They may touch you, but they can't take their eyes off of me. Sincerely, monitor."," I was going to go to the gym and run 7 miles this morning to continue trying to look good but then I remembered I own Photoshop."," Men who talk about how big their dick is actually have a tiny dick. Related: I'm hung like an Asian field mouse."," When it comes to gun control, the first thing that should be banned are tee shirt cannons."," I'm exhausted. I just did 100 sit ups. The fact that I did them over the course of 40 years doesn't diminish the accomplishment."," I like my bagels like I like my women; lightly toasted with sesame seeds and a little butter. I don't understand this joke format."," Does the world really need another rhetorical question?"," Mel Gibson, Randy Quaid and Charlie Sheen walk into a bar. I don't know what the punchline is, but I'm pretty sure the cops are showing up."," once while i was camping in Florida a raccoon got in my car and long story short if you see a raccoon driving a 97 Saturn Wagon DM me"," Tweets that proclaim \"your a idiot\" never fail to delight me."," Shout out to octopi. The spiders of the sea since 1981."," Being OCD and an optimist, I see the glass half full but I measure to make sure it's EXACTLY half."," Hey guys, trust me on this one, tweets aren't nearly as funny when they're being read aloud in a courtroom."," The good news is it wasn't a bug. The bad news is I beat the crap out of a black bean on the floor with my shoe."," Taking BuzzFeed's millennialness quiz. Apparently having mental health issues and not knowing your gender is 100% millennial."," Just getting romantic with the wife when our slow cooker set off our smoke alarm so yes, I was crock blocked."," I've never been pleased to meet anyone."," \"Don't believe everything you read\" is the best motto I've ever read. But I'm not sure if I should believe it or not. I'm so confused now."," Hell is nothing but a bunch of moms asking for help with their laptops."," Mainstream Media: Obama signs repeal of DADT. Fox News: Foreigner masquerading as President admits he's gay."," The hell with a Klondike Bar, ask me what I'd do for a box of Girl Scout Cookies."," Was just complaining about Mondays. Then I thought, \"Wow. David Lee Roth would never do that.\" So I shut up & finished my breakfast."," I left my chamomile tea steeping for too long and it turned into the new Coldplay album."," I think I could make a pretty decent living as one of those people in infomercials who have immense difficulty performing everyday tasks."," I wish my band were shittier so we could get booked on Leno :("," *Skrillex' mother puts her ear to his bedroom door* *She hears constant bass drops* *Dad walks up* \"Sounds like he's Wubbing one out..\""," You do not count as a person if it's 75 degrees & you're wearing a wool beanie."," What if you have tons of ideas but also your ideas are terrible and deserve to be taken away by the gentlest of breezes? – Inventor of Post-It Notes"," Given that my grandmother's world is upended by soup that is too salty, I can't help but question how bad The Depression REALLY was."," My BFF asked me to watch her purse while she went to the bathroom. I asked her what it was going to do. I'm hilarious. Everyone says so."," A good way to know you'll be paying more than 5 dollars for a coffee is if the guy making it looks like one of the Lumineers."," right now mitt romney is trying to put an entire loaf of bread in his mouth"," Hating everything saves countless hours of decision making"," Pretending to hold the elevator while secretly pressing \"close door\" is an art."," Today is my cheat day so I just ordered a pizza and opened a secret off-shore account."," Every generation just wants their kids to have a better “Spiderman” reboot than they did."," *confidently throws the empty macaroni box in the garbage because I don't need instructions* *pulls the box back out 3 times to make sure*"," I think most people in California replaced being polite with putting avocado in everything they eat."," One fun way to describe Facebook is “imagine you are a mind reader in Walmart.”"]
